module.exports = () => {
  return [
    '',
    {
      title: '开篇',
      collapsable: true,
      children: [
        '00/',
        '00/01.md',
        '00/02.md'
      ]
    },
    {
      title: '01 | 万丈高楼，地基首要',
      collapsable: true,
      children: [
        '01/',
        '01/01.md',
        '01/02.md',
        '01/03.md',
        '01/04.md',
        '01/05.md',
        '01/06.md',
        '01/07.md',
        '01/08.md',
        '01/09.md',
        '01/10.md',
        '01/11.md',
        '01/12.md',
        '01/13.md',
        '01/14.md',
        '01/15.md',
        '01/16.md',
        '01/17.md',
        '01/18.md',
        '01/19.md',
        '01/20.md',
        '01/21.md',
        '01/22.md',
        '01/23.md',
        '01/24.md'
      ]
    },
    {
      title: '02 | 分类、推荐、搜索、评价、购物车开发',
      collapsable: true,
      children: [
        '02/',
        '02/01.md',
        '02/02.md',
        '02/03.md',
        '02/04.md',
        '02/05.md',
        '02/06.md',
        '02/07.md'
      ]
    },
    {
      title: '03 | 地址、订单、支付、定时任务开发',
      collapsable: true,
      children: [
        '03/',
        '03/01.md',
        '03/02.md',
        '03/03.md',
        '03/04.md',
        '03/05.md'
      ]
    },
    {
      title: '04 | 用户中心 、订单、评价管理开发',
      collapsable: true,
      children: [
        '04/',
        '04/01.md',
        '04/02.md',
        '04/03.md',
        '04/04.md',
        '04/05.md'
      ]
    },    {
      title: '05 | 云服务器部署上线',
      collapsable: true,
      children: [
        '05/',
        '05/01.md',
        '05/02.md',
        '05/03.md',
        '05/04.md',
        '05/05.md'
      ]
    },
    '06/',
    '07/',
    '08/',
    '09/',
    '10/',
    '11/',
    '12/',
    '13/',
    '14/',
    '15/',
    '16/',
    '17/',
    '18/',
    '19/',
    '20/',
    '21/',
    '22/',
    '23/',
    '24/',
    '25/',
    '26/',
    '27/',
    '28/',
    '29/',
    '30/',
    '31/',
    '32/',
    '33/',
    '34/',
    '35/',
    '36/',
    '37/',
    '38/',
    '39/',
    '40/'
  ]
}
